{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"inputLayer","class_name":"InputLayer","config":{"batch_input_shape":[null,4,10,10],"dtype":"float32","sparse":false,"name":"inputLayer"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["inputLayer",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":2,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[200],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[400],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}]]]},{"name":"policyOutputLayer","class_name":"Dense","config":{"units":100,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policyOutputLayer","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"valueOutputLayer","class_name":"Dense","config":{"units":1,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"valueOutputLayer","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["inputLayer",0,0]],"output_layers":[["policyOutputLayer",0,0],["valueOutputLayer",0,0]]},"keras_version":"tfjs-layers 1.2.11","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[3,3,4,32],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[1,1,128,2],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[2],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[1,1,128,4],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[200,100],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[100],"dtype":"float32"},{"name":"policyOutputLayer/kernel","shape":[400,100],"dtype":"float32"},{"name":"policyOutputLayer/bias","shape":[100],"dtype":"float32"},{"name":"valueOutputLayer/kernel","shape":[100,1],"dtype":"float32"},{"name":"valueOutputLayer/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.2.11","convertedBy":null}